Net(
  (conv1): Conv1d(1, 45, kernel_size=(4,), stride=(1,))
  (conv2): Conv1d(45, 90, kernel_size=(4,), stride=(1,))
  (conv3): Conv1d(90, 180, kernel_size=(4,), stride=(1,))
  (fc1): Linear(in_features=3420, out_features=180, bias=True)
  (fc2): Linear(in_features=180, out_features=4, bias=True)
)/n